# 4. Написать свой модуль utils и перенести в него функцию currency_rates() из предыдущего задания. Создать скрипт,
# в котором импортировать этот модуль и выполнить несколько вызовов функции currency_rates(). Убедиться, что ничего
# лишнего не происходит.
# 5. * (вместо 4) Доработать скрипт из предыдущего задания: теперь он должен работать и из консоли. Например:
# ---------Решение------------------

import sys
from GeekBrainsLesson_4_2_and_4_3 import currency_rates
# импортируем модуль sys
# импортируем модуль GeekBrainsLesson_4_2_and_4_3

# чтобы не словить ошибку проверяем количество елеметов sys.argv
if len(sys.argv) > 1:
    # если первый элемент существует то приравниваем его к переменной currency и вызываем функцию
    # currency_rates(currency)
    currency = sys.argv[1]
    rate = currency_rates(currency)
    print(currency, rate[0], rate[1])
